[
    {
      "title": "Portside lands $50M to help manage business aviation",
      "description": "Business aviation operators are often challenged with crew and aircraft shortages as they look to scale and meet the growing post-pandemic demand for air travel. With industry-wide staffing shortages, operators need to figure out how to attract pilots and other crew members — whether it be to fill full-time vacancies or add temp positions to meet urgent scheduling needs.Inspired to build a tech-forward solution, Alek Vernitsky and Alek Strygin co-founded Portside, which allows aircraft operators to share schedules, financial and maintenance data, and other key aircraft information with owners, banks and insurance companies through a web-based portal. Portside today announced that it raised $50 million in a Series B funding round led by Insight Partners with participation from existing investors including I2BF Global Ventures, bringing the company’s total raised to more than $70 million.Portside is Vernitsky and Strygin’s second venture after tour agency startup GetGoing, which they sold to business travel management firm BCD Travel in 2016. Vernitsky was previously head of product at thredUp and for years was an SVP at BCD Travel (as was Strygin) following the GetGoing acquisition.Portside provides an integrated platform and strives to be a one-stop shop for flight departments, Vernitsky told TechCrunch via email. As operators scale, they need to capture efficiencies through technology. Portside’s product suite gives them the ability to streamline workflows while making the best use of their aviation assets.To this end, Portside provides tools to automatically allocate crew and aircraft depending on a given schedule and standardize how business aviation trips are reported. Portside’s staffing marketplace gives employers access to a database of pilot and crew while a dedicated services app helps manage crew accommodations. Beyond this, Portside maintains an operations management portal that helps schedule and dispatch government, corporate and charter flights using existing aviation systems.Business aircraft are now more capable than ever in terms of flying more people over longer distances, which means many more trips are now international, and more complex from a logistics and regulatory perspective, Vernitsky continued. Having an integrated system that combines operational, financial and maintenance data is now paramount for a successful trip.Business has been quite good, Vernitsky said — even during the pandemic. It helps that business aviation as a market is expanding at a rapid clip. A Honeywell survey released last October forecasts up to 8,500 new business jet deliveries worth $274 billion from 2023 to 2032, up 15% in both deliveries and expenditures from the same 10-year forecast a year ago. Another poll — this one from from Airbus — found that 89% of businesses with annual revenue of over $500 million plan to increase their use of business aviation in 2023.Why the robust growth? The Airbus poll provides some insight. Eighty-one percent of respondents said that they became increasingly reliant on business aviation during the pandemic while 63% cited continued expected problems in the commercial aviation sector, such as flight delays and cancellations.Whatever the reason, Portside has certainly benefited. The company claims to support almost 1,000 operators of private, business and government aircraft today in over 30 countries.  There’s over 10,000 aircraft on the Portside platform, Vernitsky claims, and over 50,000 users. Business aviation grew tremendously during the pandemic, and Portside grew about 3x per year over the past few years. Business aviation is continuing to grow, and we intend to continue developing innovative products for the industry, Vernitsky said.Vernitsky says that the capital from the latest funding round will be put toward software development and further expanding Portside’s customer base and product portfolio. The startup employs 110 people currently and expects to grow to 150 by the end of the year." ,
      "image": "",
      "category": "Startups"
    },
    {
        "title": "Netflix lists rules and exemptions to prevent account sharing outside household",
        "description": "Netflix is now detailing how it aims to maintain password sharing within a household while cracking down on outside usage. The company aims to curtail account sharing this year by asking people to pay extra money to use the streaming service outside the household for extended periods of time.The streaming giant has shared terms detailing how it plans to control the experience within a household. It has updated its FAQ pages for countries where it is already testing extra membership fees for account sharing — Chile, Costa Rica and Peru These new terms ask people to define a primary location through their TV. All the accounts and devices should be connected to the same Wi-Fi as the TV.A primary location is set by a TV that is signed into your account and is connected to your Wi-Fi network. All other devices signed into your account on that Wi-Fi network will be associated with your primary location and will be able to use Netflix, it says.If a user doesn’t set a primary location or doesn’t have a TV, Netflix will automatically set a primary location based on IP address, device IDs, and activity.After that, people living in this home who want to use Netflix on their own device have to launch the app at home at least once every 31 days.To ensure that your devices are associated with your primary location, connect to the Wi-Fi at your primary location, open the Netflix app or website, and watch something at least once every 31 days, the company says on its support page.But what if you grabbed an iPad before leaving the house for a long train ride but you rarely use this iPad at home? Chances are the device won’t be associated with your household when you try to watch something on the go. In that case, you can ask the main account holder to verify the device for you. The account holder will receive a code that they can relay to the person who is traveling. If the verification is successful the traveling member can watch Netflix for seven more days without any additional prompt.It’s unclear if you can request temporary codes several times in a row. For instance, some students would rather request a code from their parents every week instead of paying for Netflix. These conditions also prevent folks from using Netflix through VPN connections for a long period of time.The streaming company has made a ton of efforts to get more paying users on its platform. In Novemeber, it launched a cheaper $6.99 ad-supported monthly plan in the U.S., the U.K., France, Germany, Italy, Australia, Japan, Korea and Brazil. Meanwhile, it has also launched tools to kick devices off a subscription and transfer a profile from one membership to another to stop account sharing.All these efforts have brought in more subscribers to the service. During its recent Q4 2022 quarterly results, the company said it added 7.7 million subscribers — much higher than anticipated 4.5 million additions.Netflix will go through a product overhaul under the new co-CEO Greg Peters (formerly COO) after founder Reed Hastings stepped down from the post last month. At the same time, the company said that it will crack down on password sharing more broadly in the coming months. Extra member fees will likely come to more countries soon.",
        "image": "",
        "category": "Apps"
    },
    {
        "title": "Apple TV users can now watch Major League Soccer matches with MLS Season Pass",
        "description": "Today, Apple launched MLS Season Pass in over 100 territories, giving soccer fans access to all MLS matches, Audi 2023 MLS Cup Playoffs, and Leagues Cup, as well as original programming. Notably, there are no blackouts, so subscribers get to watch matches in or out of market. The 2023 MLS season begins on February 25.The ten-year deal between Major League Soccer and Apple is significant for both entities as it provides a unique experience to a large fanbase. For the 2022 MLS Cup, the league drew its biggest audience in 25 years, generating 2.155 million viewers across Fox and Univision in the U.S. If Apple’s new subscription proves to be successful, there’s potential for other streaming services and major sports leagues to consider similar agreements in the future. Apple also reportedly may have plans to bid on English Premier League football streaming rights.The best part about the 2023 season is that most MLS games on Apple will be broadcast on Saturdays and select Wednesdays, with 7:30 p.m. local start times, so fans can more easily learn when they can watch their favorite teams’ matches.To follow your favorite teams, Apple TV users can select their faves in the app under the My Sports tab, where they can also find the scores and schedules for every club. Fans can also sign up for reminders and alerts to be notified on their devices when a game is about to begin.",
        "image": "",
        "category": "Media & Entertainment"
    },
    {
        "title": "Which open source startups rocketed in 2022?",
        "description": "new report shines a light on the world of commercial open source software (COSS) startups, including which ones are growing fastest, which are raising cash and even which universities are most popular among COSS founders.The report emanates from Runa Capital, a formerly Silicon Valley-based venture capital firm that recently moved its HQ to Luxembourg. Runa previously backed a number of companies with open source foundations such as Nginx, MariaDB and N8n.Since 2020, Runa has operated what it calls the Runa Open Source Startup (ROSS) Index, ranking the top 20 fastest-growing open source startups. While the index is focused on quarterly growth, Runa just published its first annual report looking at COSS startup trends throughout the whole of 2022, as well as some broader trends dating back to the index’s inception nearly three years ago.Fast growing The ROSS Index Annual Report 2022 expands its focus to the top 50 startups rather than the top 20 as per Runa’s quarterly index, revealing that the top five fastest-growing open source companies last year were Builder.io, a no-code platform for digital storefronts; Novu, which is creating a notification infrastructure for developers; Refine, a framework for web app development; Safing, which is creating data privacy products including an application firewall; and Nhost, a backend-as-a-service provider that’s setting out to rival Firebase.",
        "image": "",
        "category": "TechCrunch"
    },
    {
        "title": "Battery darling Our Next Energy lands massive $300M Series B to build gigafactory",
        "description": "attery startup Our Next Energy announced this morning that it closed a massive $300 million Series B in an effort to get its $1.6 billion gigafactory up and running.The new round values the company at $1.2 billion post-money, marking a stunning rise for the two-and-a-half-year-old company, which closed a $25 million Series A in October 2021 and a $65 million Series A1 in March 2022.Founded by Mujeeb Ijaz — a veteran of Ford, A123 Systems and Apple’s automotive effort — ONE has focused its efforts on finding low-cost, highly available materials for its battery chemistries. The gigafactory in question will pump ou lithium-iron-phosphate cells, better known as LFP.Ijaz told TechCrunch that the first 2 gigawatt-hours of capacity at its Michigan plant will come online by the end of next year, and the remaining 18 gigawatt-hours will be added in stages over the following three years.The new round was led by Fifth Wall and Franklin Templeton, and it was joined by growth equity investors Temasek, Riverstone Holdings and Coatue; venture investors AI Capital Partners and Sente Ventures; and ONE’s Series A investors, including Breakthrough Energy Ventures, Assembly Ventures, BMW i Ventures and Volta Energy Technologies. Also joining the round are two unnamed strategic investors, a manufacturer of EV technology solutions and a renewable energy provider, the company said.Franklin Templeton’s addition is notable because it represents a shift from straight venture to including growth equity. With the investment, the firm gains a seat on the board and could become a source of debt for ONE’s equipment purchases. We’re actually seeing that as the beginning of a long-term relationship that will go past Series B into Series C and potentially as we go public, Ijaz said.ONE’s move into at-scale manufacturing comes as the U.S. battery industry is newly emboldened by the Inflation Reduction Act, which offers substantial incentives for companies to develop domestic supply chains and production. As a result, U.S. battery startups have begun to embrace their role not just as R&D shops that license their technology but as manufacturers competing with largely Asia-based giants like LG Energy Solution, CATL and SK Innovation.While ONE has gained significant government backing, including $220 million in grants from the state of Michigan, the decision to build an LFP gigafactory isn’t without risk. While LFP was invented in the U.S., most of the production today takes place in China.That’s in part because pioneering battery company A123 Systems bet big on the chemistry only to see the market for its cells evaporate. That sent the company into bankruptcy, where it was purchased for a song by a major Chinese auto parts company. Chinese companies also swept in and bought the rights to many LFP-related patents, several of which only expired last year.After the successful launch of the Tesla Model S, LFP cells were unable to deliver the range consumers expected and fell out of favor in the U.S. and Europe. Over the last decade, Chinese companies have developed vast factories that can crank out cells at low prices.In some ways, ONE’s gigafactory endeavor echoes that of A123, and that story didn’t end well. I asked Ijaz, who was an executive at the company during its rise and following its sale in bankruptcy, whether he thought this time would go any differently.I’ve thought a lot about this as I went through that experience very closely, he said. I think there are four differences.",
        "image": "",
        "category": "TechCrunch"
    },
    {
        "title": "Twitter discontinues CoTweets, says will debut text attachments next week",
        "description": "Twitter announced Tuesday that it is discontinuing CoTweeting, a feature that let two users co-author a tweet. The company said that the feature will immediately cease to exist. Users will be able to view the set of co-tweets for a month. After that, they will be automatically converted to retweets on the co-author’s pro “For the last several months we’ve been testing a new way to Tweet together using CoTweets. We’re sad to say that the current experiment is coming to an end,” the company said on the support page for CoTwee Twitter started testing CoTweets last July saying it wanted to learn how people use this feature to “strengthen their collaborations with other accounts.” There might still be some hope for the feature to come back in another form. “We’re still looking for ways to implement this feature moving forward,” Twitter sa While Twitter’s official reasoning behind shutting this feature down was generic, in a tweet Elon Musk said that the social network took the step “to focus on enabling writers to add essays as attachments to tweets.” It’s not immediately clear why it was a hindrance to writi Musk also added that next week, the social network is launching a beta version of its new Superfollows program, which will supposedly help creators publish directly on the platform and get paid for  Before Musk’s tenure at Twitter, the company had introduced a long-form writing program called Twitter Notes. But it was immediately axed under the new management. Over the last few months, Musk has hinted about introducing long text attachments.",
        "image": "",
        "category": "Apps"
    }
]